In [2]:
import pandas as pd 
import matplotlib.pyplot as plt

data ={
    "Name":["Ram" , "Shyam" , "Hari"],
    "Salary":["$2000" ,"$3000" , "$5000"]
}

df = pd.DataFrame(data)
df.to_csv("file.csv" , index=False)
print(df.head())

    Name Salary
0    Ram  $2000
1  Shyam  $3000
2   Hari  $5000

In [ ]:
df_A = pd.DataFrame({
    "Roll":[1,2,3],
    "Name":["Ram" , "Shyam" , "Hari"]
})

df_B = pd.DataFrame({
    "Roll":[1,2,5],
    "Percentage":[80 ,23,90]
})

inner_merge = pd.merge(df_A  , df_B , on="Roll", how="inner") #intersection
print(inner_merge)

   Roll   Name  Percentage
0     1    Ram          80
1     2  Shyam          23

In [ ]:
outer_merge = pd.merge(df_A  , df_B , on="Roll", how="outer") # union
print(outer_merge)

   Roll   Name  Percentage
0     1    Ram        80.0
1     2  Shyam        23.0
2     3   Hari         NaN
3     5    NaN        90.0

In [5]:
# left-> a ma matra vako right -> b ma matra vako 

left_merge = pd.merge(df_A , df_B , on="Roll" , how="left")
print(left_merge)

   Roll   Name  Percentage
0     1    Ram        80.0
1     2  Shyam        23.0
2     3   Hari         NaN

In [ ]:
import pandas as pd

df_a = pd.DataFrame(
    {"Temperature": [10, 123, 34, 54]}, index=["Day1", "Day2", "Day3", "Day4"]
)

df_b = pd.DataFrame(
    {"Humidity": [100, 1223, 344, 564]}, index=["Day1", "Day3", "Day6", "Day8"]
)

joined_df = df_a.join(df_b, how="outer")
print(joined_df)

      Temperature  Humidity
Day1         10.0     100.0
Day2        123.0       NaN
Day3         34.0    1223.0
Day4         54.0       NaN
Day6          NaN     344.0
Day8          NaN     564.0

In [15]:
# melt vaneko wide lai long format ma laaney. 

wide_df = pd.DataFrame(
    {
        "Name":["Himal","Sajina","Jina","Jitan"],
        "Age":[20 , 20 , 17 , 44],
        "Address":["Jhapa","Jhapa","Morang","Sitapuri"]
    }
)


print(wide_df)

     Name  Age   Address
0   Himal   20     Jhapa
1  Sajina   20     Jhapa
2    Jina   17    Morang
3   Jitan   44  Sitapuri

In [ ]:
# to change the wide to long format we have. 

long_df = pd.melt(
    frame=wide_df,
    id_vars="Name",
 )

print(long_df)

     Name variable     value
0   Himal      Age        20
1  Sajina      Age        20
2    Jina      Age        17
3   Jitan      Age        44
4   Himal  Address     Jhapa
5  Sajina  Address     Jhapa
6    Jina  Address    Morang
7   Jitan  Address  Sitapuri

In [31]:
# pivot_df = pd.DataFrame(
#     long_df,
#     index=[1,2,3,4],
# )
# print(pivot_df)

In [34]:
import pandas as pd

df_wide = pd.DataFrame({
    "student": ["Ram", "Sita"],
    "Math": [85, 88],
    "Science": [90, 92],
    "English": [78, 81]
})

print(df_wide)


long_df = pd.melt(
    df_wide , 
    id_vars="student",
    value_vars=["Math","Science","English"],
    var_name="subject",
    value_name="score"
)

  student  Math  Science  English
0     Ram    85       90       78
1    Sita    88       92       81

In [33]:
print(long_df)

  student  subject  score
0     Ram     Math     85
1    Sita     Math     88
2     Ram  Science     90
3    Sita  Science     92
4     Ram  English     78
5    Sita  English     81

In [35]:
stacked_df = long_df.stack()
print(stacked_df)

0  student        Ram
   subject       Math
   score           85
1  student       Sita
   subject       Math
   score           88
2  student        Ram
   subject    Science
   score           90
3  student       Sita
   subject    Science
   score           92
4  student        Ram
   subject    English
   score           78
5  student       Sita
   subject    English
   score           81
dtype: object

In [36]:
unstacked_df = stacked_df.unstack()
print(unstacked_df)

  student  subject score
0     Ram     Math    85
1    Sita     Math    88
2     Ram  Science    90
3    Sita  Science    92
4     Ram  English    78
5    Sita  English    81

In [43]:
pivot_tbl = long_df.pivot_table(
    index="student",
    columns="subject",
    values="score",
    aggfunc= "mean"   
)

print(pivot_tbl)

subject  English  Math  Science
student
Ram         78.0  85.0     90.0
Sita        81.0  88.0     92.0

In [96]:
import pandas as pd

df = pd.read_csv("test.csv")
df

   Roll    Name    Age      Address
0      1     Ram   22.0      Dharan
1      2    Sita    NaN   Kathmandu
2      3   Shyam   34.0  Biratnagar
3      4     NaN   45.0     Itahari
4      5   Himal   45.0      Morang

In [97]:
df.shape

(5, 4)

In [98]:
print(df.isna().sum())

Roll        0
 Name       1
 Age        1
 Address    0
dtype: int64

In [99]:
df.head()

   Roll    Name    Age      Address
0      1     Ram   22.0      Dharan
1      2    Sita    NaN   Kathmandu
2      3   Shyam   34.0  Biratnagar
3      4     NaN   45.0     Itahari
4      5   Himal   45.0      Morang

In [100]:
df = df.dropna()
df.head()

   Roll    Name    Age      Address
0      1     Ram   22.0      Dharan
2      3   Shyam   34.0  Biratnagar
4      5   Himal   45.0      Morang

In [102]:
df = df.dropna(axis=1)
df.head()

   Roll    Name    Age      Address
0      1     Ram   22.0      Dharan
2      3   Shyam   34.0  Biratnagar
4      5   Himal   45.0      Morang

In [ ]:
# fillna.

In [103]:
df.to_csv("final.csv",index=False)